{
	"class_name": "Functional",
	"config": {
		"name": "functional_1",
		"layers": [
			{
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						100,
						512,
						3
					],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "x_input_node"
				},
				"name": "x_input_node",
				"inbound_nodes": []
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization",
				"inbound_nodes": [
					[
						[
							"conv2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu",
				"inbound_nodes": [
					[
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						3
					],
					"padding": "valid",
					"strides": [
						2,
						3
					],
					"data_format": "channels_last"
				},
				"name": "max_pooling2d",
				"inbound_nodes": [
					[
						[
							"p_re_lu",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_1",
				"inbound_nodes": [
					[
						[
							"max_pooling2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_1",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_1",
				"inbound_nodes": [
					[
						[
							"conv2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_1",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2",
						"op": "AddV2",
						"input": [
							"p_re_lu_1/add",
							"max_pooling2d/MaxPool"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2",
				"inbound_nodes": [
					[
						[
							"p_re_lu_1",
							0,
							0,
							{}
						],
						[
							"max_pooling2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d_1",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						3
					],
					"padding": "valid",
					"strides": [
						2,
						3
					],
					"data_format": "channels_last"
				},
				"name": "max_pooling2d_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_2",
				"inbound_nodes": [
					[
						[
							"max_pooling2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_2",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_2",
				"inbound_nodes": [
					[
						[
							"conv2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_2",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_1",
						"op": "AddV2",
						"input": [
							"p_re_lu_2/add",
							"max_pooling2d_1/MaxPool"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_1",
				"inbound_nodes": [
					[
						[
							"p_re_lu_2",
							0,
							0,
							{}
						],
						[
							"max_pooling2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "MaxPooling2D",
				"config": {
					"name": "max_pooling2d_2",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						3
					],
					"padding": "valid",
					"strides": [
						2,
						3
					],
					"data_format": "channels_last"
				},
				"name": "max_pooling2d_2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_3",
				"inbound_nodes": [
					[
						[
							"max_pooling2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_3",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_3",
				"inbound_nodes": [
					[
						[
							"conv2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_3",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_2",
						"op": "AddV2",
						"input": [
							"p_re_lu_3/add",
							"max_pooling2d_2/MaxPool"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_2",
				"inbound_nodes": [
					[
						[
							"p_re_lu_3",
							0,
							0,
							{}
						],
						[
							"max_pooling2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_4",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_4",
				"inbound_nodes": [
					[
						[
							"conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_5",
					"trainable": true,
					"dtype": "float32",
					"filters": 8,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_5",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_5",
				"inbound_nodes": [
					[
						[
							"conv2d_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_6",
					"trainable": true,
					"dtype": "float32",
					"filters": 2,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_6",
				"inbound_nodes": [
					[
						[
							"batch_normalization_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_6",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_6",
				"inbound_nodes": [
					[
						[
							"conv2d_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_4",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "GlobalAveragePooling2D",
				"config": {
					"name": "global_average_pooling2d",
					"trainable": true,
					"dtype": "float32",
					"data_format": "channels_last"
				},
				"name": "global_average_pooling2d",
				"inbound_nodes": [
					[
						[
							"p_re_lu_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Softmax",
				"config": {
					"name": "output",
					"trainable": true,
					"dtype": "float32",
					"axis": -1
				},
				"name": "output",
				"inbound_nodes": [
					[
						[
							"global_average_pooling2d",
							0,
							0,
							{}
						]
					]
				]
			}
		],
		"input_layers": [
			[
				"x_input_node",
				0,
				0
			]
		],
		"output_layers": [
			[
				"output",
				0,
				0
			]
		]
	},
	"keras_version": "2.4.0",
	"backend": "tensorflow"
}