{
	"class_name": "Functional",
	"config": {
		"name": "functional_1",
		"layers": [
			{
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						512,
						512,
						1
					],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "x_input_node"
				},
				"name": "x_input_node",
				"inbound_nodes": []
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization",
				"inbound_nodes": [
					[
						[
							"conv2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d",
				"inbound_nodes": [
					[
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_1",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_1",
				"inbound_nodes": [
					[
						[
							"separable_conv2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu",
				"inbound_nodes": [
					[
						[
							"batch_normalization_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d",
				"inbound_nodes": [
					[
						[
							"re_lu",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d/cond/Identity",
							"batch_normalization/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d",
							0,
							0,
							{}
						],
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_2",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_3",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_3",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_1",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_1",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_1",
				"inbound_nodes": [
					[
						[
							"re_lu_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_1",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_1/cond/Identity",
							"batch_normalization_2/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_1",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_1",
							0,
							0,
							{}
						],
						[
							"batch_normalization_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						2,
						2
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_4",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_4",
				"inbound_nodes": [
					[
						[
							"conv2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_5",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_5",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_2",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_2",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_2",
				"inbound_nodes": [
					[
						[
							"re_lu_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_2",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_2/cond/Identity",
							"batch_normalization_4/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_2",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_2",
							0,
							0,
							{}
						],
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_6",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_6",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_7",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_7",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_3",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_3",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_3",
				"inbound_nodes": [
					[
						[
							"re_lu_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_3",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_3/cond/Identity",
							"batch_normalization_6/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_3",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_3",
							0,
							0,
							{}
						],
						[
							"batch_normalization_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						2,
						2
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_8",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_8",
				"inbound_nodes": [
					[
						[
							"conv2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_9",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_9",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_4",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_4",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_4",
				"inbound_nodes": [
					[
						[
							"re_lu_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_4",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_4",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_4/cond/Identity",
							"batch_normalization_8/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_4",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_4",
							0,
							0,
							{}
						],
						[
							"batch_normalization_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_10",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_10",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_5",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_11",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_11",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_5",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_11",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_5",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_5",
				"inbound_nodes": [
					[
						[
							"re_lu_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_5",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_5",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_5/cond/Identity",
							"batch_normalization_10/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_5",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_5",
							0,
							0,
							{}
						],
						[
							"batch_normalization_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						2,
						2
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_3",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_12",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_12",
				"inbound_nodes": [
					[
						[
							"conv2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_6",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_6",
				"inbound_nodes": [
					[
						[
							"batch_normalization_12",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_13",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_13",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_6",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_6",
				"inbound_nodes": [
					[
						[
							"batch_normalization_13",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_6",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_6",
				"inbound_nodes": [
					[
						[
							"re_lu_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_6",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_6",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_6/cond/Identity",
							"batch_normalization_12/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_6",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_6",
							0,
							0,
							{}
						],
						[
							"batch_normalization_12",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_14",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_14",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_7",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_7",
				"inbound_nodes": [
					[
						[
							"batch_normalization_14",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_15",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_15",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_7",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_7",
				"inbound_nodes": [
					[
						[
							"batch_normalization_15",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_7",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_7",
				"inbound_nodes": [
					[
						[
							"re_lu_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_7",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_7",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_7/cond/Identity",
							"batch_normalization_14/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_7",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_7",
							0,
							0,
							{}
						],
						[
							"batch_normalization_14",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						2,
						2
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_16",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_16",
				"inbound_nodes": [
					[
						[
							"conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_8",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_8",
				"inbound_nodes": [
					[
						[
							"batch_normalization_16",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_17",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_17",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_8",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_8",
				"inbound_nodes": [
					[
						[
							"batch_normalization_17",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_8",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_8",
				"inbound_nodes": [
					[
						[
							"re_lu_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_8",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_8",
						"op": "AddV2",
						"input": [
							"spatial_dropout2d_8/cond/Identity",
							"batch_normalization_16/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_8",
				"inbound_nodes": [
					[
						[
							"spatial_dropout2d_8",
							0,
							0,
							{}
						],
						[
							"batch_normalization_16",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_18",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_18",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_9",
					"trainable": true,
					"dtype": "float32",
					"filters": 32,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_9",
				"inbound_nodes": [
					[
						[
							"batch_normalization_18",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_19",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_19",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "ReLU",
				"config": {
					"name": "re_lu_9",
					"trainable": true,
					"dtype": "float32",
					"max_value": null,
					"negative_slope": 0.0,
					"threshold": 0.0
				},
				"name": "re_lu_9",
				"inbound_nodes": [
					[
						[
							"batch_normalization_19",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SpatialDropout2D",
				"config": {
					"name": "spatial_dropout2d_9",
					"trainable": true,
					"dtype": "float32",
					"rate": 0.3,
					"noise_shape": null,
					"seed": null
				},
				"name": "spatial_dropout2d_9",
				"inbound_nodes": [
					[
						[
							"re_lu_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
