{
	"class_name": "Functional",
	"config": {
		"name": "functional_1",
		"layers": [
			{
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						1024,
						1024,
						3
					],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "x_input_node"
				},
				"name": "x_input_node",
				"inbound_nodes": []
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "ResizeBilinear",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "ResizeBilinear",
						"op": "ResizeBilinear",
						"input": [
							"x_input_node",
							"ResizeBilinear/size"
						],
						"attr": {
							"align_corners": {
								"b": false
							},
							"half_pixel_centers": {
								"b": true
							},
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {
						"1": [
							512,
							512
						]
					}
				},
				"name": "tf_op_layer_ResizeBilinear",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "ResizeBilinear_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "ResizeBilinear_1",
						"op": "ResizeBilinear",
						"input": [
							"x_input_node",
							"ResizeBilinear_1/size"
						],
						"attr": {
							"align_corners": {
								"b": false
							},
							"half_pixel_centers": {
								"b": true
							},
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {
						"1": [
							256,
							256
						]
					}
				},
				"name": "tf_op_layer_ResizeBilinear_1",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "ResizeBilinear_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "ResizeBilinear_2",
						"op": "ResizeBilinear",
						"input": [
							"x_input_node",
							"ResizeBilinear_2/size"
						],
						"attr": {
							"align_corners": {
								"b": false
							},
							"half_pixel_centers": {
								"b": true
							},
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {
						"1": [
							128,
							128
						]
					}
				},
				"name": "tf_op_layer_ResizeBilinear_2",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_3",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_ResizeBilinear",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_6",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						3,
						3
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_6",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_ResizeBilinear_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_9",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						4,
						4
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_9",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_ResizeBilinear_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 8,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_4",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_4",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_8",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_8",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_12",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_12",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization",
				"inbound_nodes": [
					[
						[
							"separable_conv2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_7",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						3,
						3
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_7",
				"inbound_nodes": [
					[
						[
							"batch_normalization_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_10",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						4,
						4
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_10",
				"inbound_nodes": [
					[
						[
							"batch_normalization_12",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 8,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_5",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_5",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_9",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_9",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_13",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_13",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_1",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_1",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_5",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_8",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						3,
						3
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_8",
				"inbound_nodes": [
					[
						[
							"batch_normalization_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_11",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						4,
						4
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_11",
				"inbound_nodes": [
					[
						[
							"batch_normalization_13",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "SeparableConv2D",
				"config": {
					"name": "separable_conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 8,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null,
					"depth_multiplier": 1,
					"depthwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"pointwise_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"depthwise_regularizer": null,
					"pointwise_regularizer": null,
					"depthwise_constraint": null,
					"pointwise_constraint": null
				},
				"name": "separable_conv2d_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_6",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_6",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_10",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_10",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_14",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_14",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_11",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_2",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_2",
				"inbound_nodes": [
					[
						[
							"separable_conv2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						1,
						1
					],
					"strides": [
						1,
						1
					],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						1,
						1
					],
					"strides": [
						1,
						1
					],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						1,
						1
					],
					"strides": [
						1,
						1
					],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_14",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 8,
					"kernel_size": [
						1,
						1
					],
					"strides": [
						1,
						1
					],
					"padding": "valid",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d",
				"inbound_nodes": [
					[
						[
							"batch_normalization_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_1",
						"op": "AddV2",
						"input": [
							"conv2d_1/BiasAdd",
							"batch_normalization_4/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_1",
				"inbound_nodes": [
					[
						[
							"conv2d_1",
							0,
							0,
							{}
						],
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_2",
						"op": "AddV2",
						"input": [
							"conv2d_2/BiasAdd",
							"batch_normalization_8/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_2",
				"inbound_nodes": [
					[
						[
							"conv2d_2",
							0,
							0,
							{}
						],
						[
							"batch_normalization_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_3",
						"op": "AddV2",
						"input": [
							"conv2d_3/BiasAdd",
							"batch_normalization_12/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_3",
				"inbound_nodes": [
					[
						[
							"conv2d_3",
							0,
							0,
							{}
						],
						[
							"batch_normalization_12",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2",
						"op": "AddV2",
						"input": [
							"conv2d/BiasAdd",
							"batch_normalization/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2",
				"inbound_nodes": [
					[
						[
							"conv2d",
							0,
							0,
							{}
						],
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_7",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_7",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_11",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_11",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_15",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_15",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_3",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_3",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_1",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_2",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_11",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu_3",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_15",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "PReLU",
				"config": {
					"name": "p_re_lu",
					"trainable": true,
					"dtype": "float32",
					"alpha_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"alpha_regularizer": null,
					"alpha_constraint": null,
					"shared_axes": null
				},
				"name": "p_re_lu",
				"inbound_nodes": [
					[
						[
							"batch_normalization_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d_1",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "same",
					"strides": [
						1,
						1
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d_1",
				"inbound_nodes": [
					[
						[
							"p_re_lu_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d_2",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "same",
					"strides": [
						1,
						1
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d_2",
				"inbound_nodes": [
					[
						[
							"p_re_lu_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d_3",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "same",
					"strides": [
						1,
						1
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d_3",
				"inbound_nodes": [
					[
						[
							"p_re_lu_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "same",
					"strides": [
						1,
						1
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d",
				"inbound_nodes": [
					[
						[
							"p_re_lu",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "UpSampling2D",
				"config": {
					"name": "up_sampling2d",
					"trainable": true,
					"dtype": "float32",
					"size": [
						2,
						2
					],
					"data_format": "channels_last",
					"interpolation": "nearest"
				},
				"name": "up_sampling2d",
				"inbound_nodes": [
					[
						[
							"average_pooling2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "UpSampling2D",
				"config": {
					"name": "up_sampling2d_1",
					"trainable": true,
					"dtype": "float32",
					"size": [
						4,
						4
					],
					"data_format": "channels_last",
					"interpolation": "nearest"
				},
				"name": "up_sampling2d_1",
				"inbound_nodes": [
					[
						[
							"average_pooling2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "UpSampling2D",
				"config": {
					"name": "up_sampling2d_2",
					"trainable": true,
					"dtype": "float32",
					"size": [
						8,
						8
					],
					"data_format": "channels_last",
					"interpolation": "nearest"
				},
				"name": "up_sampling2d_2",
				"inbound_nodes": [
					[
						[
							"average_pooling2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "concat",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "concat",
						"op": "ConcatV2",
						"input": [
							"average_pooling2d/AvgPool",
							"up_sampling2d/resize/ResizeNearestNeighbor",
							"up_sampling2d_1/resize/ResizeNearestNeighbor",
							"up_sampling2d_2/resize/ResizeNearestNeighbor",
							"concat/axis"
						],
						"attr": {
							"Tidx": {
								"type": "DT_INT32"
							},
							"T": {
								"type": "DT_FLOAT"
							},
							"N": {
								"i": "4"
							}
						}
					},
					"constants": {
						"4": -1
					}
				},
				"name": "tf_op_layer_concat",
				"inbound_nodes": [
					[
						[
							"average_pooling2d",
							0,
							0,
							{}
						],
						[
							"up_sampling2d",
							0,
							0,
							{}
						],
						[
							"up_sampling2d_1",
							0,
							0,
							{}
						],
						[
							"up_sampling2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 1,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_concat",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid",
						"op": "Sigmoid",
						"input": [
							"conv2d_4/BiasAdd"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid",
				"inbound_nodes": [
					[
						[
							"conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			}
		],
		"input_layers": [
			[
				"x_input_node",
				0,
				0
			]
		],
		"output_layers": [
			[
				"tf_op_layer_Sigmoid",
				0,
				0
			]
		]
	},
	"keras_version": "2.4.0",
	"backend": "tensorflow"
}