{
	"class_name": "Functional",
	"config": {
		"name": "functional_1",
		"layers": [
			{
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						512,
						512,
						3
					],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "x_input_node"
				},
				"name": "x_input_node",
				"inbound_nodes": []
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization",
				"inbound_nodes": [
					[
						[
							"conv2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid",
						"op": "Sigmoid",
						"input": [
							"batch_normalization/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid",
				"inbound_nodes": [
					[
						[
							"batch_normalization",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul",
						"op": "Mul",
						"input": [
							"batch_normalization/cond/Identity",
							"Sigmoid"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul",
				"inbound_nodes": [
					[
						[
							"batch_normalization",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity",
						"op": "Identity",
						"input": [
							"Mul"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_1",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_1",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_1",
				"inbound_nodes": [
					[
						[
							"conv2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_1",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_1/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_1",
						"op": "Mul",
						"input": [
							"batch_normalization_1/cond/Identity",
							"Sigmoid_1"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_1",
				"inbound_nodes": [
					[
						[
							"batch_normalization_1",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_1",
						"op": "Identity",
						"input": [
							"Mul_1"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2",
						"op": "AddV2",
						"input": [
							"Identity_1",
							"Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_1",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Identity",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "valid",
					"strides": [
						2,
						2
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_2",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_2",
				"inbound_nodes": [
					[
						[
							"average_pooling2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "ResizeBilinear",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "ResizeBilinear",
						"op": "ResizeBilinear",
						"input": [
							"x_input_node",
							"ResizeBilinear/size"
						],
						"attr": {
							"half_pixel_centers": {
								"b": true
							},
							"align_corners": {
								"b": false
							},
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {
						"1": [
							256,
							256
						]
					}
				},
				"name": "tf_op_layer_ResizeBilinear",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_2",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_2",
				"inbound_nodes": [
					[
						[
							"conv2d_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "ResizeBilinear_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "ResizeBilinear_1",
						"op": "ResizeBilinear",
						"input": [
							"x_input_node",
							"ResizeBilinear_1/size"
						],
						"attr": {
							"align_corners": {
								"b": false
							},
							"T": {
								"type": "DT_FLOAT"
							},
							"half_pixel_centers": {
								"b": true
							}
						}
					},
					"constants": {
						"1": [
							128,
							128
						]
					}
				},
				"name": "tf_op_layer_ResizeBilinear_1",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_4",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_ResizeBilinear",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_2",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_2/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_8",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_8",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_ResizeBilinear_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_4",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_4",
				"inbound_nodes": [
					[
						[
							"conv2d_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_2",
						"op": "Mul",
						"input": [
							"batch_normalization_2/cond/Identity",
							"Sigmoid_2"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_2",
				"inbound_nodes": [
					[
						[
							"batch_normalization_2",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_8",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_8",
				"inbound_nodes": [
					[
						[
							"conv2d_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_4",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_4",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_4/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_2",
						"op": "Identity",
						"input": [
							"Mul_2"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_8",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_8",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_8/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_8",
				"inbound_nodes": [
					[
						[
							"batch_normalization_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_4",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_4",
						"op": "Mul",
						"input": [
							"batch_normalization_4/cond/Identity",
							"Sigmoid_4"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_4",
				"inbound_nodes": [
					[
						[
							"batch_normalization_4",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_1",
						"op": "AddV2",
						"input": [
							"Identity_2",
							"average_pooling2d/AvgPool"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_2",
							0,
							0,
							{}
						],
						[
							"average_pooling2d",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_8",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_8",
						"op": "Mul",
						"input": [
							"batch_normalization_8/cond/Identity",
							"Sigmoid_8"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_8",
				"inbound_nodes": [
					[
						[
							"batch_normalization_8",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_4",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_4",
						"op": "Identity",
						"input": [
							"Mul_4"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_8",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_8",
						"op": "Identity",
						"input": [
							"Mul_8"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_8",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "AveragePooling2D",
				"config": {
					"name": "average_pooling2d_1",
					"trainable": true,
					"dtype": "float32",
					"pool_size": [
						2,
						2
					],
					"padding": "valid",
					"strides": [
						2,
						2
					],
					"data_format": "channels_last"
				},
				"name": "average_pooling2d_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_5",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_5",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_6",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						7,
						7
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_6",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_9",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						5,
						5
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_9",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_10",
					"trainable": true,
					"dtype": "float32",
					"filters": 64,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						2,
						2
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_10",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_3",
					"trainable": true,
					"dtype": "float32",
					"filters": 16,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_3",
				"inbound_nodes": [
					[
						[
							"average_pooling2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_5",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_5",
				"inbound_nodes": [
					[
						[
							"conv2d_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_6",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_6",
				"inbound_nodes": [
					[
						[
							"conv2d_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_9",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_9",
				"inbound_nodes": [
					[
						[
							"conv2d_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_10",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_10",
				"inbound_nodes": [
					[
						[
							"conv2d_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_3",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_3",
				"inbound_nodes": [
					[
						[
							"conv2d_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_5",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_5",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_5/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_6",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_6",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_6/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_6",
				"inbound_nodes": [
					[
						[
							"batch_normalization_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_9",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_9",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_9/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_9",
				"inbound_nodes": [
					[
						[
							"batch_normalization_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_10",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_10",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_10/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_10",
				"inbound_nodes": [
					[
						[
							"batch_normalization_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_3",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_3/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_5",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_5",
						"op": "Mul",
						"input": [
							"batch_normalization_5/cond/Identity",
							"Sigmoid_5"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_5",
				"inbound_nodes": [
					[
						[
							"batch_normalization_5",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_6",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_6",
						"op": "Mul",
						"input": [
							"batch_normalization_6/cond/Identity",
							"Sigmoid_6"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_6",
				"inbound_nodes": [
					[
						[
							"batch_normalization_6",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_9",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_9",
						"op": "Mul",
						"input": [
							"batch_normalization_9/cond/Identity",
							"Sigmoid_9"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_9",
				"inbound_nodes": [
					[
						[
							"batch_normalization_9",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_10",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_10",
						"op": "Mul",
						"input": [
							"batch_normalization_10/cond/Identity",
							"Sigmoid_10"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_10",
				"inbound_nodes": [
					[
						[
							"batch_normalization_10",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_3",
						"op": "Mul",
						"input": [
							"batch_normalization_3/cond/Identity",
							"Sigmoid_3"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_3",
				"inbound_nodes": [
					[
						[
							"batch_normalization_3",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_5",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_5",
						"op": "Identity",
						"input": [
							"Mul_5"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_5",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_5",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_6",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_6",
						"op": "Identity",
						"input": [
							"Mul_6"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_6",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_6",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_9",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_9",
						"op": "Identity",
						"input": [
							"Mul_9"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_9",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_9",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_10",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_10",
						"op": "Identity",
						"input": [
							"Mul_10"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_10",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_10",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Identity_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Identity_3",
						"op": "Identity",
						"input": [
							"Mul_3"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Identity_3",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Mul_3",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_3",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_3",
						"op": "AddV2",
						"input": [
							"Identity_5",
							"Identity_4"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_3",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_5",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Identity_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_4",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_4",
						"op": "AddV2",
						"input": [
							"Identity_6",
							"Identity_4"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_4",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_6",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Identity_4",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_5",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_5",
						"op": "AddV2",
						"input": [
							"Identity_9",
							"Identity_8"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_5",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_9",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Identity_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_6",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_6",
						"op": "AddV2",
						"input": [
							"Identity_10",
							"Identity_8"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_6",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_10",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Identity_8",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "AddV2_2",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "AddV2_2",
						"op": "AddV2",
						"input": [
							"Identity_3",
							"average_pooling2d_1/AvgPool"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_AddV2_2",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_Identity_3",
							0,
							0,
							{}
						],
						[
							"average_pooling2d_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "concat",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "concat",
						"op": "ConcatV2",
						"input": [
							"AddV2_3",
							"AddV2_4",
							"AddV2_1",
							"concat/axis"
						],
						"attr": {
							"N": {
								"i": "3"
							},
							"T": {
								"type": "DT_FLOAT"
							},
							"Tidx": {
								"type": "DT_INT32"
							}
						}
					},
					"constants": {
						"3": -1
					}
				},
				"name": "tf_op_layer_concat",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_3",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_AddV2_4",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_AddV2_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "concat_1",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "concat_1",
						"op": "ConcatV2",
						"input": [
							"AddV2_5",
							"AddV2_6",
							"AddV2_2",
							"concat_1/axis"
						],
						"attr": {
							"Tidx": {
								"type": "DT_INT32"
							},
							"T": {
								"type": "DT_FLOAT"
							},
							"N": {
								"i": "3"
							}
						}
					},
					"constants": {
						"3": -1
					}
				},
				"name": "tf_op_layer_concat_1",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_AddV2_5",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_AddV2_6",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_AddV2_2",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_7",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_7",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_concat",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "Conv2D",
				"config": {
					"name": "conv2d_11",
					"trainable": true,
					"dtype": "float32",
					"filters": 10,
					"kernel_size": [
						3,
						3
					],
					"strides": [
						1,
						1
					],
					"padding": "same",
					"data_format": "channels_last",
					"dilation_rate": [
						1,
						1
					],
					"groups": 1,
					"activation": "linear",
					"use_bias": false,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "conv2d_11",
				"inbound_nodes": [
					[
						[
							"tf_op_layer_concat_1",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_7",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_7",
				"inbound_nodes": [
					[
						[
							"conv2d_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "BatchNormalization",
				"config": {
					"name": "batch_normalization_11",
					"trainable": true,
					"dtype": "float32",
					"axis": [
						3
					],
					"momentum": 0.99,
					"epsilon": 0.001,
					"center": true,
					"scale": true,
					"beta_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"gamma_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"moving_mean_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"moving_variance_initializer": {
						"class_name": "Ones",
						"config": {}
					},
					"beta_regularizer": null,
					"gamma_regularizer": null,
					"beta_constraint": null,
					"gamma_constraint": null
				},
				"name": "batch_normalization_11",
				"inbound_nodes": [
					[
						[
							"conv2d_11",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_7",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_7",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_7/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_7",
				"inbound_nodes": [
					[
						[
							"batch_normalization_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Sigmoid_11",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Sigmoid_11",
						"op": "Sigmoid",
						"input": [
							"batch_normalization_11/cond/Identity"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Sigmoid_11",
				"inbound_nodes": [
					[
						[
							"batch_normalization_11",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_7",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_7",
						"op": "Mul",
						"input": [
							"batch_normalization_7/cond/Identity",
							"Sigmoid_7"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_7",
				"inbound_nodes": [
					[
						[
							"batch_normalization_7",
							0,
							0,
							{}
						],
						[
							"tf_op_layer_Sigmoid_7",
							0,
							0,
							{}
						]
					]
				]
			},
			{
				"class_name": "TensorFlowOpLayer",
				"config": {
					"name": "Mul_11",
					"trainable": true,
					"dtype": "float32",
					"node_def": {
						"name": "Mul_11",
						"op": "Mul",
						"input": [
							"batch_normalization_11/cond/Identity",
							"Sigmoid_11"
						],
						"attr": {
							"T": {
								"type": "DT_FLOAT"
							}
						}
					},
					"constants": {}
				},
				"name": "tf_op_layer_Mul_11",
				"inbound_nodes": [
					[
						[
							"batch_normalization_11",
							0,
							0,
