{
	"class_name": "Functional",
	"config": {
		"name": "functional_1",
		"layers": [
			{
				"class_name": "InputLayer",
				"config": {
					"batch_input_shape": [
						null,
						1
					],
					"dtype": "float32",
					"sparse": false,
					"ragged": false,
					"name": "x_input_node"
				},
				"name": "x_input_node",
				"inbound_nodes": []
			},
			{
				"class_name": "Dense",
				"config": {
					"name": "dense",
					"trainable": true,
					"dtype": "float32",
					"units": 1,
					"activation": "linear",
					"use_bias": true,
					"kernel_initializer": {
						"class_name": "GlorotUniform",
						"config": {
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros",
						"config": {}
					},
					"kernel_regularizer": null,
					"bias_regularizer": null,
					"activity_regularizer": null,
					"kernel_constraint": null,
					"bias_constraint": null
				},
				"name": "dense",
				"inbound_nodes": [
					[
						[
							"x_input_node",
							0,
							0,
							{}
						]
					]
				]
			}
		],
		"input_layers": [
			[
				"x_input_node",
				0,
				0
			]
		],
		"output_layers": [
			[
				"dense",
				0,
				0
			]
		]
	},
	"keras_version": "2.4.0",
	"backend": "tensorflow"
}